---
kind: property
id: P:Autodesk.Revit.DB.Structure.Rebar.IncludeFirstBar
zh: 钢筋、配筋
source: html/099e72c3-a92f-b14c-fada-ef91241f5152.htm
---
# Autodesk.Revit.DB.Structure.Rebar.IncludeFirstBar Property

**中文**: 钢筋、配筋

Identifies if the first bar in rebar set is shown.

## Syntax (C#)
```csharp
public bool IncludeFirstBar { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InapplicableDataException** - This rebar element represents a single bar (the layout rule is Single).